module.exports.config = {
  name: "ajan",
  version: "2.0",
  Permssion: 0,
  credits: "Islamick Cyber Chat",
  prefix : true,
  description: "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  category: "AutoTime",
  countDown: 3
};

module.exports.onLoad = async ({ api }) => {
  const timerData = {
    "04:55 AM": {
      message: ".   ╭•┄┅══❁🌺❁══┅┄•╮\n»✨ফজরে আজান✨\n   ╰•┄┅══❁🌺❁══┅┄•╯\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার - \n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ -\n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ - \n আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n  আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n-হাইয়া আলাস্ সালা -হাইয়া আলাস্ সালা-\nহাইয়া আলাল ফালাহ্ - হাইয়া আলাল ফালাহ্- \nআল্লাহু আকবার - আল্লাহু আকবার- \nলা ইলাহা ইল্লাল্লাহ -\n✢━━━━━━━━━━━━━━━✢\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ━➢ 𝐈𝐬𝐥𝐦𝐚𝐢𝐜𝐤 𝐂𝐡𝐚𝐭\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n",
      url: "https://i.imgur.com/ExHFW9D.mp4"
    },
"12:55 PM": {
      message: ".   ╭•┄┅══❁🌺❁══┅┄•╮\n•✨জোহরের আজান✨«\n  ╰•┄┅══❁🌺❁══┅┄•╯\n•⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার - \n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ -\n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ - \n আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n  আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n-হাইয়া আলাস্ সালা -হাইয়া আলাস্ সালা-\nহাইয়া আলাল ফালাহ্ - হাইয়া আলাল ফালাহ্- \nআল্লাহু আকবার - আল্লাহু আকবার- \nলা ইলাহা ইল্লাল্লাহ -\n✢━━━━━━━━━━━━━━━✢\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ━➢ 𝐈𝐬𝐥𝐦𝐚𝐢𝐜𝐤 𝐂𝐡𝐚𝐭\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n",
      url: "https://i.imgur.com/KC4Nh0u.mp4"
    },
    "04:45 PM": {
      message: ".   ╭•┄┅══❁🌺❁══┅┄•╮\n•✨আসর আজান✨\n   ╰•┄┅══❁🌺❁══┅┄•╯\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার - \n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ -\n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ - \n আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n  আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n-হাইয়া আলাস্ সালা -হাইয়া আলাস্ সালা-\nহাইয়া আলাল ফালাহ্ - হাইয়া আলাল ফালাহ্- \nআল্লাহু আকবার - আল্লাহু আকবার- \nলা ইলাহা ইল্লাল্লাহ -\n✢━━━━━━━━━━━━━━━✢\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ━➢ 𝐈𝐬𝐥𝐦𝐚𝐢𝐜𝐤 𝐂𝐡𝐚𝐭\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n",
      url: "https://i.imgur.com/aPrzSns.mp4"
    },
    "06:50 PM": {
      message: ".   ╭•┄┅══❁🌺❁══┅┄•╮\n✨মাগরিব আজান✨\n  ╰•┄┅══❁🌺❁══┅┄•╯\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার - \n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ -\n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ - \n আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n  আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n-হাইয়া আলাস্ সালা -হাইয়া আলাস্ সালা-\nহাইয়া আলাল ফালাহ্ - হাইয়া আলাল ফালাহ্- \nআল্লাহু আকবার - আল্লাহু আকবার- \nলা ইলাহা ইল্লাল্লাহ -\n✢━━━━━━━━━━━━━━━✢\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ━➢ 𝐈𝐬𝐥𝐦𝐚𝐢𝐜𝐤 𝐂𝐡𝐚𝐭\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n",
      url: "https://i.imgur.com/05HEHuY.mp4"
    },
    "08:30 PM": {
      message: ".   ╭•┄┅══❁🌺❁══┅┄•╮\n✨ইশা আজান✨\n   ╰•┄┅══❁🌺❁══┅┄•╯\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার -আল্লাহু আকবার - \n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ -\n আশহাদু-আল লা- ইলাহা ইল্লাল্লাহ - \n আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n  আশহাদু-আন্না মুহাম্মাদুর রাসুলুল্লাহ - \n-হাইয়া আলাস্ সালা -হাইয়া আলাস্ সালা-\nহাইয়া আলাল ফালাহ্ - হাইয়া আলাল ফালাহ্- \nআল্লাহু আকবার - আল্লাহু আকবার- \nলা ইলাহা ইল্লাল্লাহ -\n✢━━━━━━━━━━━━━━━✢\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ━➢ 𝐈𝐬𝐥𝐦𝐚𝐢𝐜𝐤 𝐂𝐡𝐚𝐭\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n",
      url: "https://i.imgur.com/Q26yXXi.mp4"
    }
  };

  const checkTimeAndSendMessage = async () => {
    const currentTime = new Date(Date.now() + 21600000).toLocaleTimeString('en-US', {
      hour: '2-digit',
      minute: '2-digit',
      hour12: true
    }).split(',').pop().trim();

    if (timerData[currentTime]) {
      console.log(timerData[currentTime].message);
      console.log(timerData[currentTime].url);
      try {
       let messageData = { body: timerData[currentTime].message,attachment:(await require('axios').get(timerData[currentTime].url, { responseType: 'stream' })).data };

        global.data.allThreadID.forEach(i => api.sendMessage(messageData, i));
      } catch (error) {
        console.error(`Failed to send message for time ${currentTime}:`, error);
      }
    }
    setTimeout(checkTimeAndSendMessage, 45000);
  };

  checkTimeAndSendMessage();
};

module.exports.run= ({}) => {};
