module.exports.config = {
    name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "nazrul",
  description: "msg",
  prefix: true, 
  category: "user", 
  usages: "",
  cooldowns: 5,
  dependencies: {
	}
};
const nam = [{
timer: '12:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 𝗔𝐌\nধুমপান বিষ পান__/🦂🎭\nজেনে শুনে কেন খান__/😇\nভালো যদি থাকতে চান __/🧟‍♂️\nসিগারেট ছেরে গাঞ্জা খান__/🌚___ধন্যবাদ_______🐸🐸\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 ====='], 
},
{
timer: '1:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 𝗔𝐌\n এখন রাত ১২ টা বাজে\n সারাদিন কেউ পটেনি\n-----এতো রাতে আর পটবে না🤣\n সবাই ঘুমিয়ে পড়ো🙂🙂\n ===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '2:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 A𝐌\nএখন রাত ১ টা বাজে\n__জানো মা__★\n-"তুমি আকাশের সবচেয়ে সুন্দর  তারা.\nლ༎__কারণ তুমি ছাড়া আমি পথ  হারা.!!\n__যাদের মা আছে \n_____তারাই  একবার  বলি,,,\n🍀🥀_আলহামদুলিল্লাহ_🥀🍀               \n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '3:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 A𝐌 ⏳            𝙎𝙃𝙊𝙉𝘼🥺 𝙀𝙏𝙊 𝙍𝘼𝙏𝙀 𝙆𝙄 𝙆𝙊𝙍𝙊 😳\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '4:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 A𝐌 ⏳             𝙍𝘼𝙏 𝙅𝙀𝙂𝙀 𝙇𝘼𝙑 𝙆𝙄 𝙃𝙊𝙔𝙀𝘾𝙃𝙀 𝙂𝙃𝙐𝙈𝘼 𝙎𝙊𝙄𝙏𝘼𝙉 🌃\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '5:00:00 AM',
message: ['──── •😻• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 A𝐌 ⏳             𝙀𝙏𝙏𝙊 𝙍𝘼𝙏 𝙅𝙀 𝙅𝙀𝙂𝙀𝘾𝙃𝙄𝙎! 𝙀𝙆𝙏𝙊 𝙋𝙊𝙍𝙀𝙄 𝙏𝙊𝙍 𝘼𝙈𝙈𝙐 𝙐𝙎𝙏𝘼 𝘿𝙄𝙔𝙀 𝙐𝙏𝙃𝘼𝘽𝙀🤣                     ──── •😻• ────']
},
{
timer: '6:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 𝗔𝐌 LOVE MORNING BACCARA 🥱🥱🥱🥱\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '7:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 A𝐌 ⏳             𝙂𝙊𝙊𝘿 𝙈𝙊𝙍𝙉𝙄𝙉𝙂 𝙀𝙑𝙀𝙍𝙔𝙊𝙉𝙀🌅\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '8:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:00AM কাপুরুষ আটকায় সৌন্দর্যে,\n--কু-নারী আটকায় অর্থে,\nমানুষ আটকায় মায়ায়,\n---অমানুষ আটকায় স্বার্থে..।\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '9:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:00 A𝐌 ⏳ \n- জ্বর আসছে কিছু খাইতে পারি না\n- চা দিয়া মাত্র ১৫টা রুটি খাইছি\n- কি আর করমু রুচি নাই 😔\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '10:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:00 A𝐌 ⏳シ︎🥺পৃথিবীর সবচেয়ে ভয়ংকর\n--- রোগের নাম হচ্ছে মায়া- ༅༎🦋⊱|\nযেটা মানুষকে মৃত্যুর আগেই\n---- জিন্দালাশ বানিয়ে দেয়🥺||\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '11:00:00 AM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 A𝐌\n😹বিদ্যুৎ অফিস থেকে বলছি 😒\n--আই লাভ ইউ বলবা🙈🙈\nনাকি সুইচ অফ করে দিবো😁.\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '12:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 A𝐌 ⏳\nকিছু কিছু মেয়েদেরকে \n---মেকাপ ছাড়াও সুন্দর লাগে\n যেমন এই গ্রুপের এডমিন এর নানি😸😸😸\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '1:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 𝐏𝐌\n আমাকে তুমি রিপ্লাই দেও \nনাকি ও-ষু-ধ দেও বুঝিনা.!\n- সকালে একটা দুপুরে একটা রাতে একটা.!🙂\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '2:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 𝐏𝐌 ⏳\nসবার FB password দাও ভিডিও বানাবো😒\n──── •😻• ────']
},
{
timer: '3:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 𝐏𝐌 ⏳চাইলেই কি ধরে রাখা যায় !\n--যদি সে থাকতে না চায়\n\nবেঁধে রেখে লাভ নাই🥀\n---উড়তে দিয়ে দেখো 🥀\nদিন শেষে যদি ফিরে আসে 🥀🌸\n---তখনি আগলে রাখো \n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '4:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n   𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 𝐏𝐌 যাই একটা খেলে আসি।🫣🫣\nরাতে প্রচুর মেয়ে পটানো লাগবে🤣🤣\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '5:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 𝐏𝐌\n গাইস বিকেল ৪টার একটা গান শুনেন\n-বেঁচে আছো মরার মতো😏\n---তুমি কেন মরো না😛\n-মরে গেলে চল্লিশা খাইতাম 😋\n---তুমি কেন বুঝো না😸\n-মরার নাটক মিথ্যে ছিল 🙊\n---সুইসাইড ছিল ছলনা😁\n-পাষাণ বন্ধু তুমি কেন 🙂\n---এত দিনেও মরলা না😐 \n\n♪♪কেমন হইলো গানটা🤭😁🤣\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '6:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 𝐏𝐌 ⏳ \nটাকার বিনিময়ে চুম্মা দিই🥱\n\nঅডিও - ৫০\nভিডিও - ১০০\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '7:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 𝐏𝐌\n𝐆𝐨𝐨𝐝 𝐄𝐯𝐞𝐧𝐢𝐧𝐠 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞,😍\nসবাই সন্ধার নাস্তা গিলছো কি??😁😁\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '8:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:00 𝐏𝐌 ⏳\nGf নাই বলে খোটা দিবেন না.!🥹\n----হয় একটা খুঁজে দেন.!🙈🙈\n নাহলে নিজেই পটে যান..🫣\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '9:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n  𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:00 𝐏𝐌\n-সবাই গ্রুফ থেকে চলে যাও 🥺🥺࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌\n🙃\n❁ཻ͜͡ღ᭄আমি একটু একা থাকতে চাই😒😒!࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '10:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:00 𝐏𝐌\nএকদিন সবাইকে চমকে দিবো\nহয়তো সফলতা টানে\nনয়তো আগরবাতির ঘ্রানে ===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
},
{
timer: '11:00:00 PM',
message: ['======== 𝗧𝗜𝗠𝗘 =========\n𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 P𝐌 ⏳\nএকদিন সবাইকে চমকে দিবো\nহয়তো সফলতার টানে\nনয়তো আগরবাতির ঘ্রাণে\n===== 𝐍𝐀𝐙𝐑𝐔𝐋 𝐁𝐎𝐓 =====']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
